mushBrainDave/esp32-p4-imx-camera/examples/imx219_capture/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32p4"

# PSRAM — frame buffers live in SPIRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# esp_video: enable the MIPI-CSI capture device and the ISP pipeline
CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y

# IMX219 add-on driver + auto-detect on MIPI-CSI
CONFIG_CAMERA_IMX219=y
CONFIG_CAMERA_IMX219_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y

# Bigger main task stack for the V4L2 ioctl dance
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
